{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 3], "dtype": "float32", "input_dim": 25042, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 3}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1000, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1000, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 25042, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001999999862164259, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of37.bin", "group1-shard2of37.bin", "group1-shard3of37.bin", "group1-shard4of37.bin", "group1-shard5of37.bin", "group1-shard6of37.bin", "group1-shard7of37.bin", "group1-shard8of37.bin", "group1-shard9of37.bin", "group1-shard10of37.bin", "group1-shard11of37.bin", "group1-shard12of37.bin", "group1-shard13of37.bin", "group1-shard14of37.bin", "group1-shard15of37.bin", "group1-shard16of37.bin", "group1-shard17of37.bin", "group1-shard18of37.bin", "group1-shard19of37.bin", "group1-shard20of37.bin", "group1-shard21of37.bin", "group1-shard22of37.bin", "group1-shard23of37.bin", "group1-shard24of37.bin", "group1-shard25of37.bin", "group1-shard26of37.bin", "group1-shard27of37.bin", "group1-shard28of37.bin", "group1-shard29of37.bin", "group1-shard30of37.bin", "group1-shard31of37.bin", "group1-shard32of37.bin", "group1-shard33of37.bin", "group1-shard34of37.bin", "group1-shard35of37.bin", "group1-shard36of37.bin", "group1-shard37of37.bin"], "weights": [{"name": "dense/kernel", "shape": [1000, 1000], "dtype": "float32"}, {"name": "dense/bias", "shape": [1000], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1000, 25042], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [25042], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [25042, 10], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [10, 4000], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [1000, 4000], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [4000], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [1000, 4000], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [1000, 4000], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [4000], "dtype": "float32"}]}]}